# Identifying and filling in missing data

In [27]:
import pandas as pd
import numpy as np

In [28]:
titanic_df = pd.read_csv('./datasets/titanic/train.csv')

In [29]:
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Replacement Strategy 1: Find the mean of all non null age values

In [30]:
import numpy as np 
mean_val = np.nanmean(titanic_df['Age'])
print(mean_val)

29.69911764705882

In [31]:
titanic_df['Age_repl1'] = titanic_df['Age']

In [32]:
titanic_df['Age_repl1'].replace(np.nan, mean_val, inplace=True)

In [33]:
titanic_df['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [34]:
titanic_df['Age_repl1'].describe()

count    891.000000
mean      29.699118
std       13.002015
min        0.420000
25%       22.000000
50%       29.699118
75%       35.000000
max       80.000000
Name: Age_repl1, dtype: float64

### Replacement Strategy 2: Find the mean of all non null age values after removing outliers ( considering 2 standard deviations )

In [35]:
import numpy as np 
mean = np.nanmean(titanic_df['Age'])
standard_deviation = np.nanstd(titanic_df['Age'])
dist_from_mean = abs(titanic_df['Age'] - mean)
is_non_outlier = dist_from_mean < 2 * standard_deviation
no_outliers = titanic_df['Age'][is_non_outlier]
mean_without_outlier =  np.nanmean(no_outliers)

In [36]:
titanic_df['Age_repl2'] = titanic_df['Age']

In [37]:
titanic_df['Age_repl2'].replace(np.nan, mean_without_outlier, inplace=True)

In [38]:
titanic_df['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [39]:
titanic_df['Age_repl2'].describe()

count    891.000000
mean      29.423716
std       13.013789
min        0.420000
25%       22.000000
50%       28.312774
75%       35.000000
max       80.000000
Name: Age_repl2, dtype: float64

### Replacement Strategy 3: Random sampling from Normal Distribution ( Mean & std found from input data)

In [73]:
import numpy as np 
mean = np.nanmean(titanic_df['Age'])
std = np.nanstd(titanic_df['Age'])
numOfNullAge = titanic_df['Age'].isnull().sum()
normal_dist = np.random.normal(mean, std, numOfNullAge)

for index in range(0,len(normal_dist)): #Replace the negative value
    if normal_dist[index] < 0:
        normal_dist[index] = abs(normal_dist[index])
        
titanic_df['Age_repl3'] = titanic_df['Age']
null_age = titanic_df['Age'].isnull()
titanic_df["Age_repl3"].loc[null_age] = normal_dist #Replace nulls with random sample values

In [42]:
titanic_df['Age_repl3'].describe()

count    891.000000
mean      29.946555
std       14.509318
min        0.420000
25%       20.036866
50%       28.310176
75%       39.000000
max       80.000000
Name: Age_repl3, dtype: float64

In [41]:
titanic_df['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

### Replacement Strategy 4: Random sampling from Normal Distribution ( Mean & std found from input data after removing outliers )

In [43]:
import numpy as np 
mean = np.nanmean(titanic_df['Age'])
std = np.nanstd(titanic_df['Age'])

dist_from_mean = abs(titanic_df['Age'] - mean)
non_outlier = dist_from_mean < 2 * std
no_outliers = titanic_df['Age'][non_outlier]
mean_without_outlier =  np.nanmean(no_outliers)
std_without_outlier = np.nanstd(no_outliers)

numOfNullAge = titanic_df['Age'].isnull().sum()
normal_dist = np.random.normal(mean_without_outlier, std_without_outlier, numOfNullAge)

for index in range(0,len(normal_dist)): #Replace the negative value
    if normal_dist[index] < 0:
        normal_dist[index] = abs(normal_dist[index])
        
titanic_df['Age_repl4'] = titanic_df['Age']
null_age = titanic_df['Age'].isnull()
titanic_df["Age_repl4"].loc[null_age] = normal_dist #Replace nulls with random sample values

In [44]:
titanic_df['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [45]:
titanic_df['Age_repl4'].describe()

count    891.000000
mean      29.346999
std       14.173566
min        0.420000
25%       20.000000
50%       28.500000
75%       38.000000
max       80.000000
Name: Age_repl4, dtype: float64

### Replacement Strategy 5: Replace by average age after grouping by sex

In [46]:
titanic_df['Age_repl5'] = titanic_df['Age']
titanic_df['Age_repl5'].fillna(titanic_df.groupby(['Sex'])['Age'].transform('mean'), inplace=True)

In [47]:
titanic_df['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [48]:
titanic_df['Age_repl5'].describe()

count    891.000000
mean      29.736034
std       13.014897
min        0.420000
25%       22.000000
50%       30.000000
75%       35.000000
max       80.000000
Name: Age_repl5, dtype: float64

### Part 2 :

In [63]:
import numpy as np 

male_titanic_df = titanic_df[titanic_df['Sex'] == 'male']
female_titanic_df = titanic_df[titanic_df['Sex'] == 'female']

survived_titanic_df = titanic_df[titanic_df['Survived'] == 1]
not_survived_titanic_df = titanic_df[titanic_df['Survived'] == 0]

In [64]:
male_titanic_df['Age'].describe()

count    453.000000
mean      30.726645
std       14.678201
min        0.420000
25%       21.000000
50%       29.000000
75%       39.000000
max       80.000000
Name: Age, dtype: float64

In [65]:
male_titanic_df['Age_repl5'].describe()

count    577.000000
mean      30.726645
std       13.002618
min        0.420000
25%       23.000000
50%       30.726645
75%       35.000000
max       80.000000
Name: Age_repl5, dtype: float64

In [66]:
female_titanic_df['Age'].describe()

count    261.000000
mean      27.915709
std       14.110146
min        0.750000
25%       18.000000
50%       27.000000
75%       37.000000
max       63.000000
Name: Age, dtype: float64

In [67]:
female_titanic_df['Age_repl5'].describe()

count    314.000000
mean      27.915709
std       12.860150
min        0.750000
25%       21.000000
50%       27.915709
75%       35.000000
max       63.000000
Name: Age_repl5, dtype: float64

In [68]:
survived_titanic_df['Age'].describe()

count    290.000000
mean      28.343690
std       14.950952
min        0.420000
25%       19.000000
50%       28.000000
75%       36.000000
max       80.000000
Name: Age, dtype: float64

In [69]:
survived_titanic_df['Age_repl5'].describe()

count    342.000000
mean      28.410122
std       13.774087
min        0.420000
25%       21.000000
50%       27.915709
75%       35.000000
max       80.000000
Name: Age_repl5, dtype: float64

In [70]:
not_survived_titanic_df['Age'].describe()

count    424.000000
mean      30.626179
std       14.172110
min        1.000000
25%       21.000000
50%       28.000000
75%       39.000000
max       74.000000
Name: Age, dtype: float64

In [71]:
not_survived_titanic_df['Age_repl5'].describe()

count    549.000000
mean      30.562012
std       12.460355
min        1.000000
25%       23.000000
50%       30.726645
75%       35.000000
max       74.000000
Name: Age_repl5, dtype: float64